/* Alert panel button title. */
/*"Cancel"		=	"Cancel";*/

/* Title of alert to confirm shutting down the computer. */
/*"Power"			= 	"Shut Down";*/

/* Title of default button in alert to confirm shutting down the computer. */
/*"Power Off"		=	"Shut Down";*/

/* Title of alert to confirm restarting the computer. */
/*"Restart"		=	"Restart";*/

/* Message in alert to confirm restarting the computer. */
/*"Restart Message"	=	"Are you sure you want to restart your computer now?";*/


/* Default UNC notification button title */
"OK"			=	"OK"; 


/**********Logout Messages For Fast Logout**************/
"LOGGING_OUT"	= 	"Logging Out";

"SHUTTING_DOWN"	=	"Shutting Down";

"RESTARTING"	=	"Restarting";

/********************************************************/


/* Message in alert to confirm force quitting an application. Parameter is the name of an application.*/
"FORCE_QUIT_ALERT_MESSAGE"	= 	"Do you want to force %@ to quit?";
"FORCE_QUIT_INFO_MESSAGE"	=	"You will lose any unsaved changes.";


/*loMem specific text*/

"LOMEM_MESSAGE_TEXT" = "To make more memory available, select an application and click Force Quit.";

"NORMAL_MESSAGE_TEXT" = "If an application doesn't respond for a while, select its name and click Force Quit.";

"LOMEM_INFO_TEXT" = "Closing windows and removing files from your startup disk will also help.";

"NORMAL_INFO_TEXT" = "You can open this window by pressing \nCommand+Option+Escape.";

/* This text MAY be used IF HI decides we need to offer a normal quit option in addition to a force quit option for the lomem panel */
/*  Added prior to loc freeze for Tiger.  If it doesn't get used, it can be deleted post Tiger */
"LOMEM_ALTERNATE_FORCE_QUIT_BUTTON_NAME" = "Force Quit";


/**** logout Failues *****/

/* Alert text when an app times out. Parameter is the name of an application.*/


"TIMED_OUT_ALERT_MESSAGE"	= "Logout has timed out because the application %@ failed to quit. To try again, quit %@ and choose Log Out from the Apple menu.";
"TIMED_OUT_ALERT_MESSAGE_UNKNOWN"	= "Logout has timed out because an application failed to quit. ";

/* Info text when an app times out*/
"TIMED_OUT_INFO_MESSAGE"	= "You can use the Force Quit menu item in the Apple menu (or press Command+Option+Esc) to quit an unresponsive application.";

"TIMED_OUT_NOT_RESPONDING_MESSAGE" = "The application %@ failed to quit and is not responding.";

/* Alert text when an app Cancels. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE"	 = "The application %@ canceled logout.";

/* Alert text when an unknown app Cancels. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_UNKNOWN"	 = "An application has canceled logout.";

/* Main message of alert displayed when a known app cancels logout leading to FileVault encryption */
"KNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_ENCRYPTION_MESSAGE" = "The application %@ canceled logout. FileVault will not be turned on for this account.";

/* Main message of alert displayed when an unknown app cancels logout leading to FileVault encryption */
"UNKNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_ENCRYPTION_MESSAGE" = "An application has canceled logout. FileVault will not be turned on for this account.";

/* Info text of alert displayed when an app cancels logout leading to FileVault encryption */
"APP_CANCELED_LOGOUT_TO_FILE_VAULT_ENCRYPTION_INFO_TEXT" = "This account will be left unencrypted. To turn FileVault on, open System Preferences and begin again. If you just set the master password, you do not need to set it again.";

/* Main message of alert displayed when a known app cancels logout leading to FileVault decryption */
"KNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_DECRYPTION_MESSAGE" = "The application %@ canceled logout. FileVault will not be turned off for this account.";

/* Main message of alert displayed when an unknown app cancels logout leading to FileVault decryption */
"UNKNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_DECRYPTION_MESSAGE" = "An application has canceled logout. FileVault will not be turned off for this account.";

"KNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_CONVERSION_MESSAGE" = "The application %@ canceled logout. FileVault will not be converted for this account.";

"UNKNOWN_APP_CANCELED_LOGOUT_TO_FILE_VAULT_CONVERSION_MESSAGE" = "An application has canceled logout. FileVault will not be converted for this account.";

/* Info text of alert displayed when an app cancels logout leading to FileVault decryption */
"APP_CANCELED_LOGOUT_TO_FILE_VAULT_DECRYPTION_INFO_TEXT" = "The account will be left encrypted. To turn FileVault off, open System Preferences and begin again.";

"APP_CANCELED_LOGOUT_TO_FILE_VAULT_CONVERSION_INFO_TEXT" = "The account will be left with the original format. To convert FileVault, open System Preferences and begin again.";

/* Info text when an app Cancels. Parameter is the name of an application.*/
"CANCELLED_INFO_MESSAGE"	 = "To try again, quit %@ and choose Log Out from the Apple menu.";
"CANCELLED_INFO_MESSAGE_UNKNOWN"	 = "To try again, choose Log Out from the Apple menu.";

/* Alert text when an app cancels restart. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_RESTART"	 = "The application %@ canceled restart.";

/* Alert text when an unknown app cancels restart. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_UNKNOWN_RESTART"	 = "An application has canceled restart.";

/* Info text when an app cancels restart. Parameter is the name of an application.*/
"CANCELLED_INFO_MESSAGE_RESTART"	 = "To try again, quit %@ and choose Restart from the Apple menu.";
"CANCELLED_INFO_MESSAGE_UNKNOWN_RESTART"	 = "To try again, choose Restart from the Apple menu.";



/* Alert text when an app cancels shutdown. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_SHUTDOWN"	 = "The application %@ canceled shut down.";

/* Alert text when an unknown app cancels shutdown. Parameter is the name of an application.*/
"CANCELLED_ALERT_MESSAGE_UNKNOWN_SHUTDOWN"	 = "An application has canceled shut down.";

/* Info text when an app cancels shutdown. Parameter is the name of an application.*/
"CANCELLED_INFO_MESSAGE_SHUTDOWN"	 = "To try again, quit %@ and choose Shut Down from the Apple menu.";
"CANCELLED_INFO_MESSAGE_UNKNOWN_SHUTDOWN"	 = "To try again, choose Shut Down from the Apple menu.";



/*** Ickiness with the Finder ***/
/* FINDER_FAILED_MESSAGE */
"FINDER_FAILED_MESSAGE"	=	"The Finder could not start up because a serious problem has occurred.";


"APP_DIED_ALERT_MESSAGE"		=   "The application %@ has unexpectedly quit.";

/* Info text when an app dies*/
"APP_DIED_INFO_MESSAGE"		=   "The system and other applications have not been affected.";


/*** Alert button titles ***/

/*Alert panel button title*/
"OK_BUTTON"		=	"OK";

/*Alert panel button title*/
"CANCEL_BUTTON"		=	"Cancel";

/*Alert panel button title*/
/*"CONTINUE"		=	"Continue to Logout";*/

/*Alert panel button title*/
"SHUTDOWN_BUTTON"		=	"Shut Down";

/*Alert panel button title*/
"RESTART_BUTTON"		=	"Restart";

/*Alert panel button title*/
"SLEEP_BUTTON"		=	"Sleep";

/* Logout Button */
/*"LOGOUT_BUTTON"		=	"Log Out";*/

/* Force Quit Button */
"FORCEQUIT_BUTTON"	=	"Force Quit";

/* Terminate button */
"TERMINATE_BUTTON"	=	"Force Quit";

/*Relaunch Button - this is the Finder relaunch button in the Process Panel*/
"RELAUNCH_BUTTON"	=	"Relaunch";

/*Pause Button - This is the text that shows in the Pause button when the current app is not paused*/
"PAUSE_BUTTON"		=	"Pause";

/*Pause Button - This is the text that shows in the Pause button when the current app is not paused*/
"RESUME_BUTTON"	=	"Resume";

/*Message in alert to confirm that the user wants to shut down*/
"SHUTDOWN_MESSAGE"	= 	"Are you sure you want to shut down your computer now?";

/*Message in alert to confirm that the user wants to restart*/
"RESTART_MESSAGE"	= 	"Are you sure you want to restart your computer now?";

/*Message in alert to confirm that the user wants to log out*/
"LOGOUT_MESSAGE"	=	"Are you sure you want to quit all applications and log out now?";

/*Message in alert to indicate a scheduled sleep is occuring*/
"SCHEDULED_SLEEP_MESSAGE" = "This computer has been scheduled to go to sleep automatically.";

/*Message in alert to indicate a scheduled shutdown is occuring*/
"SCHEDULED_SHUTDOWN_MESSAGE" = "This computer has been scheduled to shut down automatically.";

/*Message in alert to indicate a scheduled restart  is occuring*/
"SCHEDULED_RESTART_MESSAGE" = "This computer has been scheduled to restart automatically.";

/****************************************************************************/
/* Time formats and strings for logout, shutdown and restart time phrases   */
/****************************************************************************/

/*Plural Minutes Plural Seconds %1$d = minutes (greater than 1).  %2$d = number of seconds (greater than 1) */
"TIME_FORMAT_22" = "%1$d minutes and %2$d seconds";

/*Plural Minutes Single Second.  %d = number of minutes (greater than 1) */
"TIME_FORMAT_21" = "%d minutes and 1 second";

/*Plural Minutes Zero Seconds. %d = number of minutes (greater than 1) */
"TIME_FORMAT_20" = "%d minutes";

/*Single Minute Plural Seconds. %d = number of seconds (greater than 1) */
"TIME_FORMAT_12" = "1 minute and %d seconds";

/*Single Minute Single Second. */
"TIME_FORMAT_11" = "1 minute and 1 second";

/*Single Minute Zero Seconds. */
"TIME_FORMAT_10" = "1 minute";

/*Zero Minutes Plural Seconds %d = number of seconds (greater than 1) */
"TIME_FORMAT_2" = "%d seconds";

/*Zero Minutes One Second*/
"TIME_FORMAT_1" = "1 second";

/*Zero Minutes Zero Seconds*/
"TIME_FORMAT_0" = "0 seconds";


/******************************************/
/* Timed logout/shutdown/restart messages */
/******************************************/

/* Timed logout message. %@ is replaced by one of the time phrases above. */
"WILL_LOGOUT_INFO" = "If you do nothing, the system will log out automatically in %@.";

/* Timed shutdown message. %@ is replaced by one of the time phrases above. */
"WILL_SHUTDOWN_INFO" = "If you do nothing, the system will shut down automatically in %@.";

/* Timed restart message. %@ is replaced by one of the time phrases above. */
"WILL_RESTART_INFO" = "If you do nothing, the system will restart automatically in %@.";

/* Timed Scheduled shutdown message. %@ is replaced by one the the time phrases above. */
"WILL_SCHEDULED_SHUTDOWN_INFO" = "If you do nothing, the system will shut down automatically in %@.";

/* Timed Scheduled shutdown message. %@ is replaced by one the the time phrases above. */
"WILL_SCHEDULED_SLEEP_INFO" = "If you do nothing, the system will sleep automatically in %@.";

/* Timed Scheduled restart message. %@ is replaced by one the the time phrases above. */
"WILL_SCHEDULED_RESTART_INFO" = "If you do nothing, the system will restart automatically in %@.";


/******************************************/
/* Guest account related strings          */
/******************************************/
"GUEST_ACCOUNT_SHUTDOWN_MESSAGE" = "Shutting down will delete your files.";

"GUEST_ACCOUNT_SHUTDOWN_INFO_MESSAGE" = "You are logged in as a guest user. Shutting down deletes all files and information in the guest user home folder. These files cannot be recovered.";

"GUEST_ACCOUNT_RESTART_MESSAGE" = "Restarting will delete your files.";

"GUEST_ACCOUNT_RESTART_INFO_MESSAGE" = "You are logged in as a guest user. Restarting deletes all files and information in the guest user home folder. These files cannot be recovered.";

"GUEST_ACCOUNT_LOGOUT_MESSAGE" = "Logging out will delete your files.";


/*Password Hint*/
/*"PASSWORD_HINT_TEXT"	=	"You've entered an invalid password 3 times.";*/

/*"FORCEQUIT"		=	 "Force Quit...";*/

/*"LOGGINGIN"		=	 "Logging In...";*/

/* tesxt for go back button when password field is displayed*/

/*"BACKTOLIST"			=		"Go Back";*/

/*"OTHERUSER"			=		"Other...";*/

/*"NAME"			=		"Name";*/

/*Disk Full First Message*/
/*"DISKFULLMESSAGE1"		= "Your hard disk has no more space available for application memory. Quit some applications immediately, or your computer will have problems.";*/

/*Disk Full First Instructional Text*/
/*"DISKFULLINSTRUCT1"		=    "Closing windows and removing files from your hard disk may also help." ;*/

/*Empty Trash*/
/*"EMPTYTRASH" 		=    "Empty Trash";*/

// LIB not found
"LIB_NOT_FOUND" = "The application %@ could not be opened because %@ could not be found";

// Lib no found but no app name

"LIB_NOT_FOUND_NO_APPNAME" = "That application could not be opened because %@ could not be found";

// launch Failed
"LAUNCH_FAILED_MESSAGE" = "Launch of %@ failed";

// launch Failed no name
"LAUNCH_FAILED_NONAME_MESSAGE" = "Launch of that Application Failed";

// unknown ( for unknown library, appliction name etc.)
"UNKNOWN" = "unknown";

/****** Bad Time Set by User *************/

"ILLEGAL_TIME_TITLE" = "Your computer's clock is set to a date before March 24th, 2001. This may cause some applications to behave erratically.";

"ILLEGAL_TIME_MESSAGE" = "Please use the Date & Time preference panel to set the clock manually. For more information, choose Mac Help from the Help menu.";


/****** Users Connected *************/

/* Message when AFP users are connected on shutdown and restart*/

"AFP_USERS_CONNECTED" = "Apple File Sharing Users Connected";
"AFP_USERS_CONNECTED_RESTART_TITLE" = "Are you sure you want to restart your computer now?";
"AFP_USERS_CONNECTED_SHUTDOWN_TITLE" = "Are you sure you want to shut down your computer now?";

/*Info when AFP users are connected on shutdown */
"AFP_USERS_CONNECTED_SHUTDOWN_INFO" = "There are %d connections to this computer using Apple File Sharing.";
"AFP_SINGLE_USER_CONNECTED_SHUTDOWN_INFO" = "There is a user connected to this computer using Apple File Sharing.";

/* Info when AFP users are connected on restart */
"AFP_USERS_CONNECTED_RESTART_INFO" = "There are %d connections to this computer using Apple File Sharing.";
"AFP_SINGLE_USER_CONNECTED_RESTART_INFO" = "There is a user connected to this computer using Apple File Sharing.";

/********** Screen Lock Password **********/

/* Message for unlocking the screen lock modal dialog */
/* It should not mention anything about the METHOD for authentication */
/* such as entering as password. Instructions regarding the method for */
/* for authentication will be appended by the SecurityAgent */
"Enter your password to unlock the screen."="You must authenticate to unlock the screen.";

/**********Disk Messages ******************/

/*"DISKFULLMESSAGE2" 		=  "Your boot volume has no space available, and your computer is having problems. You may want to force quit some applications to avoid further problems.";*/

/*"DISKFULLINSTRUCT2"		=  "Closing windows and removing files from your hard disk may also help.";*/

/*"REPLACE_HOMEFOLDER_TEXT"	=	" The %@ folder for user %@ cannot be found in its usual location.";*/

/*"REPLACE_HOMEFOLDER_INFO_TEXT" =  "The \"Home\" or \"Users\" folder may have been moved or deleted. If \"Home\" is located on the network, the server may be temporarily unavailable. Contact your administrator if this problem continues.";*/

"APP_NOT_RESPONDING_SUFFIX"	= " (not responding)";

"APP_PAUSED_SUFFIX" = " (paused)";

/********** AFP/SMB Login Error Messages *********/

/* Format string used to build primary message string of alert that is presented when an error occurs mounting an AFP or SMB home directory. */
/* %@ is replaced with the name of the user account. */

"AFP_SMB_LOGIN_ERROR_MESSAGE_FORMAT" = "You are unable to log in to the user account \"%@\" at this time";

/* Info string (secondary message) of alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"AFP_SMB_LOGIN_ERROR_INFO" = "Logging in to the account failed because an error occurred. The home folder for the user account is located on an AFP or SMB server. Contact your system administrator for help.";

/* Label for OK button in alert that is presented when an error ocurs mounting an AFP or SMB home directory. */
"AFP_SMB_LOGIN_ERROR_OK_BUTTON" = "OK";
